Revit 2027 API
ITransactionFinalizer.OnRolledBack Method
 This method is called at the end of rolling back a transaction
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void OnRolledBack(
	Document document,
	string strTransactionName
)
Sub OnRolledBack (
	document As Document,
	strTransactionName As String
)
void OnRolledBack(
	Document^ document,
	String^ strTransactionName
)
abstract OnRolledBack :
        document : Document *
        strTransactionName : string -> unit
Parameters
document Document
 The document associated with the transaction
strTransactionName String
 The transaction's name
See Also
Reference
ITransactionFinalizer Interface
Autodesk.Revit.DB Namespace